<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN"
  "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">

<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title>Evaluating LLMs in Cypher Statement Generation</title>
<link href="../Styles/Style.css" type="text/css" rel="stylesheet"/>
</head>
<body>
<h1>Evaluating LLMs in Cypher Statement Generation</h1>
<blockquote>原文：<a href="https://towardsdatascience.com/evaluating-llms-in-cypher-statement-generation-c570884089b3?source=collection_archive---------2-----------------------#2024-01-19">https://towardsdatascience.com/evaluating-llms-in-cypher-statement-generation-c570884089b3?source=collection_archive---------2-----------------------#2024-01-19</a></blockquote><div><div class="em fe ff fg fh fi"/><div class="fj fk fl fm fn"><div class="ab cb"><div class="ci bh ev ew ex ey"><div/><div><h2 id="a2bb" class="pw-subtitle-paragraph gn fp fq bf b go gp gq gr gs gt gu gv gw gx gy gz ha hb hc cq dx">Step-by-step tutorial for assessing the accuracy of generated Cypher Statements</h2><div><div class="speechify-ignore ab cp"><div class="speechify-ignore bh l"><div class="hd he hf hg hh ab"><div><div class="ab hi"><div><div class="bm" aria-hidden="false"><a href="https://bratanic-tomaz.medium.com/?source=post_page---byline--c570884089b3--------------------------------" rel="noopener follow"><div class="l hj hk by hl hm"><div class="l ed"><img alt="Tomaz Bratanic" class="l ep by dd de cx" src="../Images/d5821aa70918fcb3fc1ff0013497b3d5.png" width="44" height="44" loading="lazy" data-testid="authorPhoto" data-original-src="https://miro.medium.com/v2/resize:fill:88:88/1*SnWQP0l4Vg9577WAErbjfw.jpeg"/><div class="hn by l dd de em n ho eo"/></div></div></a></div></div><div class="hp ab ed"><div><div class="bm" aria-hidden="false"><a href="https://towardsdatascience.com/?source=post_page---byline--c570884089b3--------------------------------" rel="noopener follow"><div class="l hq hr by hl hs"><div class="l ed"><img alt="Towards Data Science" class="l ep by br ht cx" src="../Images/a6ff2676ffcc0c7aad8aaf1d79379785.png" width="24" height="24" loading="lazy" data-testid="publicationPhoto" data-original-src="https://miro.medium.com/v2/resize:fill:48:48/1*CJe3891yB1A1mzMdqemkdg.jpeg"/><div class="hn by l br ht em n ho eo"/></div></div></a></div></div></div></div></div><div class="bn bh l"><div class="ab"><div style="flex:1"><span class="bf b bg z bk"><div class="hu ab q"><div class="ab q hv"><div class="ab q"><div><div class="bm" aria-hidden="false"><p class="bf b hw hx bk"><a class="af ag ah ai aj ak al am an ao ap aq ar hy" data-testid="authorName" href="https://bratanic-tomaz.medium.com/?source=post_page---byline--c570884089b3--------------------------------" rel="noopener follow">Tomaz Bratanic</a></p></div></div></div><span class="hz ia" aria-hidden="true"><span class="bf b bg z dx">·</span></span><p class="bf b hw hx dx"><button class="ib ic ah ai aj ak al am an ao ap aq ar id ie if" disabled="">Follow</button></p></div></div></span></div></div><div class="l ig"><span class="bf b bg z dx"><div class="ab cn ih ii ij"><div class="ik il ab"><div class="bf b bg z dx ab im"><span class="in l ig">Published in</span><div><div class="l" aria-hidden="false"><a class="af ag ah ai aj ak al am an ao ap aq ar hy ab q" data-testid="publicationName" href="https://towardsdatascience.com/?source=post_page---byline--c570884089b3--------------------------------" rel="noopener follow"><p class="bf b bg z io ip iq ir is it iu iv bk">Towards Data Science</p></a></div></div></div><div class="h k"><span class="hz ia" aria-hidden="true"><span class="bf b bg z dx">·</span></span></div></div><span class="bf b bg z dx"><div class="ab ae"><span data-testid="storyReadTime">9 min read</span><div class="iw ix l" aria-hidden="true"><span class="l" aria-hidden="true"><span class="bf b bg z dx">·</span></span></div><span data-testid="storyPublishDate">Jan 19, 2024</span></div></span></div></span></div></div></div><div class="ab cp iy iz ja jb jc jd je jf jg jh ji jj jk jl jm jn"><div class="h k w ea eb q"><div class="kd l"><div class="ab q ke kf"><div class="pw-multi-vote-icon ed in kg kh ki"><div class=""><div class="kj kk kl km kn ko kp am kq kr ks ki"><svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewbox="0 0 24 24" aria-label="clap"><path fill-rule="evenodd" d="M11.37.828 12 3.282l.63-2.454zM15.421 1.84l-1.185-.388-.338 2.5zM9.757 1.452l-1.184.389 1.523 2.112zM20.253 11.84 17.75 7.438c-.238-.353-.57-.584-.93-.643a.96.96 0 0 0-.753.183 1.13 1.13 0 0 0-.443.695c.014.019.03.033.044.053l2.352 4.138c1.614 2.95 1.1 5.771-1.525 8.395a7 7 0 0 1-.454.415c.997-.13 1.927-.61 2.773-1.457 2.705-2.704 2.517-5.585 1.438-7.377M12.066 9.01c-.129-.687.08-1.299.573-1.773l-2.062-2.063a1.123 1.123 0 0 0-1.555 0 1.1 1.1 0 0 0-.273.521z" clip-rule="evenodd"/><path fill-rule="evenodd" d="M14.741 8.309c-.18-.267-.446-.455-.728-.502a.67.67 0 0 0-.533.127c-.146.113-.59.458-.199 1.296l1.184 2.503a.448.448 0 0 1-.236.755.445.445 0 0 1-.483-.248L7.614 6.106A.816.816 0 1 0 6.459 7.26l3.643 3.644a.446.446 0 1 1-.631.63L5.83 7.896l-1.03-1.03a.82.82 0 0 0-1.395.577.81.81 0 0 0 .24.576l1.027 1.028 3.643 3.643a.444.444 0 0 1-.144.728.44.44 0 0 1-.486-.098l-3.64-3.64a.82.82 0 0 0-1.335.263.81.81 0 0 0 .178.89l1.535 1.534 2.287 2.288a.445.445 0 0 1-.63.63l-2.287-2.288a.813.813 0 0 0-1.393.578c0 .216.086.424.238.577l4.403 4.403c2.79 2.79 5.495 4.119 8.681.931 2.269-2.271 2.708-4.588 1.342-7.086z" clip-rule="evenodd"/></svg></div></div></div><div class="pw-multi-vote-count l kt ku kv kw kx ky kz"><p class="bf b dy z dx"><span class="kk">--</span></p></div></div></div><div><div class="bm" aria-hidden="false"><button class="ao kj lc ld ab q ee le lf" aria-label="responses"><svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewbox="0 0 24 24" class="lb"><path d="M18.006 16.803c1.533-1.456 2.234-3.325 2.234-5.321C20.24 7.357 16.709 4 12.191 4S4 7.357 4 11.482c0 4.126 3.674 7.482 8.191 7.482.817 0 1.622-.111 2.393-.327.231.2.48.391.744.559 1.06.693 2.203 1.044 3.399 1.044.224-.008.4-.112.486-.287a.49.49 0 0 0-.042-.518c-.495-.67-.845-1.364-1.04-2.057a4 4 0 0 1-.125-.598zm-3.122 1.055-.067-.223-.315.096a8 8 0 0 1-2.311.338c-4.023 0-7.292-2.955-7.292-6.587 0-3.633 3.269-6.588 7.292-6.588 4.014 0 7.112 2.958 7.112 6.593 0 1.794-.608 3.469-2.027 4.72l-.195.168v.255c0 .056 0 .151.016.295.025.231.081.478.154.733.154.558.398 1.117.722 1.659a5.3 5.3 0 0 1-2.165-.845c-.276-.176-.714-.383-.941-.59z"/></svg><p class="bf b dy z dx"><span class="pw-responses-count la lb">2</span></p></button></div></div></div><div class="ab q jo jp jq jr js jt ju jv jw jx jy jz ka kb kc"><div class="lg k j i d"/><div class="h k"><div><div class="bm" aria-hidden="false"><button aria-controls="addToCatalogBookmarkButton" aria-expanded="false" aria-label="Add to list bookmark button" data-testid="headerBookmarkButton" class="af ee ah ai aj ak al lh an ao ap id li lj lk" disabled=""><svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" fill="none" viewbox="0 0 24 24" class="av"><path fill="#000" d="M17.5 1.25a.5.5 0 0 1 1 0v2.5H21a.5.5 0 0 1 0 1h-2.5v2.5a.5.5 0 0 1-1 0v-2.5H15a.5.5 0 0 1 0-1h2.5zm-11 4.5a1 1 0 0 1 1-1H11a.5.5 0 0 0 0-1H7.5a2 2 0 0 0-2 2v14a.5.5 0 0 0 .8.4l5.7-4.4 5.7 4.4a.5.5 0 0 0 .8-.4v-8.5a.5.5 0 0 0-1 0v7.48l-5.2-4a.5.5 0 0 0-.6 0l-5.2 4z"/></svg></button></div></div></div><div class="ep ll cn"><div class="l ae"><div class="ab cb"><div class="lm ln lo lp lq lr ci bh"><div class="ab"><div class="bm bh" aria-hidden="false"><div><div class="bm" aria-hidden="false"><button aria-label="Listen" data-testid="audioPlayButton" class="af ee ah ai aj ak al lh an ao ap id ls lt lf lu lv lw lx ly s lz ma mb mc md me mf u mg mh mi"><svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" fill="none" viewbox="0 0 24 24"><path fill="currentColor" fill-rule="evenodd" d="M3 12a9 9 0 1 1 18 0 9 9 0 0 1-18 0m9-10C6.477 2 2 6.477 2 12s4.477 10 10 10 10-4.477 10-10S17.523 2 12 2m3.376 10.416-4.599 3.066a.5.5 0 0 1-.777-.416V8.934a.5.5 0 0 1 .777-.416l4.599 3.066a.5.5 0 0 1 0 .832" clip-rule="evenodd"/></svg><div class="j i d"><p class="bf b bg z dx">Listen</p></div></button></div></div></div></div></div></div></div></div><div class="bm" aria-hidden="false" aria-describedby="postFooterSocialMenu" aria-labelledby="postFooterSocialMenu"><div><div class="bm" aria-hidden="false"><button aria-controls="postFooterSocialMenu" aria-expanded="false" aria-label="Share Post" data-testid="headerSocialShareButton" class="af ee ah ai aj ak al lh an ao ap id ls lt lf lu lv lw lx ly s lz ma mb mc md me mf u mg mh mi"><svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" fill="none" viewbox="0 0 24 24"><path fill="currentColor" fill-rule="evenodd" d="M15.218 4.931a.4.4 0 0 1-.118.132l.012.006a.45.45 0 0 1-.292.074.5.5 0 0 1-.3-.13l-2.02-2.02v7.07c0 .28-.23.5-.5.5s-.5-.22-.5-.5v-7.04l-2 2a.45.45 0 0 1-.57.04h-.02a.4.4 0 0 1-.16-.3.4.4 0 0 1 .1-.32l2.8-2.8a.5.5 0 0 1 .7 0l2.8 2.79a.42.42 0 0 1 .068.498m-.106.138.008.004v-.01zM16 7.063h1.5a2 2 0 0 1 2 2v10a2 2 0 0 1-2 2h-11c-1.1 0-2-.9-2-2v-10a2 2 0 0 1 2-2H8a.5.5 0 0 1 .35.15.5.5 0 0 1 .15.35.5.5 0 0 1-.15.35.5.5 0 0 1-.35.15H6.4c-.5 0-.9.4-.9.9v10.2a.9.9 0 0 0 .9.9h11.2c.5 0 .9-.4.9-.9v-10.2c0-.5-.4-.9-.9-.9H16a.5.5 0 0 1 0-1" clip-rule="evenodd"/></svg><div class="j i d"><p class="bf b bg z dx">Share</p></div></button></div></div></div><div class="bm" aria-hidden="false"><div><div class="bm" aria-hidden="false"><button aria-label="More options" data-testid="headerStoryOptionsButton" class="af ee ah ai aj ak al lh an ao ap id ls lt lf lu lv lw lx ly s lz ma mb mc md me mf u mg mh mi"><svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" fill="none" viewbox="0 0 24 24"><path fill="currentColor" fill-rule="evenodd" d="M4.385 12c0 .55.2 1.02.59 1.41.39.4.86.59 1.41.59s1.02-.2 1.41-.59c.4-.39.59-.86.59-1.41s-.2-1.02-.59-1.41a1.93 1.93 0 0 0-1.41-.59c-.55 0-1.02.2-1.41.59-.4.39-.59.86-.59 1.41m5.62 0c0 .55.2 1.02.58 1.41.4.4.87.59 1.42.59s1.02-.2 1.41-.59c.4-.39.59-.86.59-1.41s-.2-1.02-.59-1.41a1.93 1.93 0 0 0-1.41-.59c-.55 0-1.03.2-1.42.59s-.58.86-.58 1.41m5.6 0c0 .55.2 1.02.58 1.41.4.4.87.59 1.43.59s1.03-.2 1.42-.59.58-.86.58-1.41-.2-1.02-.58-1.41a1.93 1.93 0 0 0-1.42-.59c-.56 0-1.04.2-1.43.59s-.58.86-.58 1.41" clip-rule="evenodd"/></svg><div class="j i d"><p class="bf b bg z dx">More</p></div></button></div></div></div></div></div></div></div></div></div><figure class="mm mn mo mp mq mr mj mk paragraph-image"><div role="button" tabindex="0" class="ms mt ed mu bh mv"><div class="mj mk ml"><img src="../Images/88372b2e2c33a680583b4fc6098d1e1a.png" data-original-src="https://miro.medium.com/v2/resize:fit:1400/format:webp/1*inssFCPgCuwwCI3nD4t7TQ.png"/></div></div><figcaption class="mx my mz mj mk na nb bf b bg z dx">Image generated by DALL-E</figcaption></figure><p id="03db" class="pw-post-body-paragraph nc nd fq ne b go nf ng nh gr ni nj nk nl nm nn no np nq nr ns nt nu nv nw nx fj bk">Shortly after large language models (LLMs) became popular, we realized they were decent at translating natural language to database queries such as SQL and Cypher. To enable the LLM to create tailored queries for your particular database, you must provide its schema and, optionally, a few example queries. With this information, the LLM can generate database queries based on natural language input.</p><p id="5401" class="pw-post-body-paragraph nc nd fq ne b go nf ng nh gr ni nj nk nl nm nn no np nq nr ns nt nu nv nw nx fj bk">While LLMs show great potential at translating natural language to database queries, they are far from perfect. Therefore, it is essential to understand how well they perform using an evaluation process. Luckily, the process of generating SQL statements has been researched by academia in studies like the <a class="af ny" href="https://arxiv.org/abs/1809.08887" rel="noopener ugc nofollow" target="_blank">Spider</a>. We will use the following metrics to evaluate the Cypher generation ability of LLMs.</p><ul class=""><li id="987f" class="nc nd fq ne b go nf ng nh gr ni nj nk nl nm nn no np nq nr ns nt nu nv nw nx nz oa ob bk"><strong class="ne fr">Jaro-Winkler</strong>: This is a text similarity metric based on edit distance. We compare the produced Cypher query to a correct Cypher query, and measure how different the strings are, by how much one would have to edit one query to be the same as the other query</li><li id="5df7" class="nc nd fq ne b go oc ng nh gr od nj nk nl oe nn no np of nr ns nt og nv nw nx nz oa ob bk"><strong class="ne fr">Pass@1: </strong>This score is 1.0 if the produced query returns the same results from the database as the correct Cypher would, and 0.0 otherwise.</li><li id="561c" class="nc nd fq ne b go oc ng nh gr od nj nk nl oe nn no np of nr ns nt og nv nw nx nz oa ob bk"><strong class="ne fr">Pass@3: </strong>Similar to Pass@1, but instead of generating 1 query, we generate 3 queries. If any of them produce the same results as the correct query the score is 1.0, otherwise 0.0</li><li id="21fe" class="nc nd fq ne b go oc ng nh gr od nj nk nl oe nn no np of nr ns nt og nv nw nx nz oa ob bk"><strong class="ne fr">Jaccard similarity: </strong>It measures the Jaccard similarity between the response returned by the produced Cypher and the correct Cypher’s response. This metric is used in mind to capture examples where the model may return almost correct results.</li></ul><p id="b33e" class="pw-post-body-paragraph nc nd fq ne b go nf ng nh gr ni nj nk nl nm nn no np nq nr ns nt nu nv nw nx fj bk">Code is available on <a class="af ny" href="https://github.com/tomasonjo/blogs/blob/master/llm/evaluating_cypher.ipynb" rel="noopener ugc nofollow" target="_blank">GitHub</a> as was developed in collaboration with <span class="ia"><span class="ia" aria-hidden="false"><a class="oh ib oi" href="https://medium.com/u/8b125c49d121?source=post_page---user_mention--c570884089b3--------------------------------" rel="noopener" target="_blank">Adam Schill Collberg</a></span></span>.</p><p id="d96d" class="pw-post-body-paragraph nc nd fq ne b go nf ng nh gr ni nj nk nl nm nn no np nq nr ns nt nu nv nw nx fj bk">As you can observe, the focus is on evaluating responses from the database and not the actual Cypher statement itself. One reason is that a Cypher statement can be written multiple ways to retrieve identical information. We don’t care which syntax the LLM prefers; we only care that it produces correct responses. Additionally, we don’t have a strong preference for how the LLM names the column in responses, and therefore, we don’t want to evaluate its column naming abilities, etc…</p><h2 id="27d0" class="oj ok fq bf ol om on oo op oq or os ot nl ou ov ow np ox oy oz nt pa pb pc pd bk">Test dataset</h2><p id="76d3" class="pw-post-body-paragraph nc nd fq ne b go pe ng nh gr pf nj nk nl pg nn no np ph nr ns nt pi nv nw nx fj bk">The test dataset consists of question and relevant Cypher statement pairs.</p><figure class="mm mn mo mp mq mr"><div class="pj io l ed"><div class="pk pl l"/></div></figure><p id="2b2d" class="pw-post-body-paragraph nc nd fq ne b go nf ng nh gr ni nj nk nl nm nn no np nq nr ns nt nu nv nw nx fj bk">You can use an LLM to generate suggestions for the testing dataset. However, you need to manually validate the examples as the LLMs make mistakes and aren’t 100% reliable. If they were, we wouldn’t need to test them anyway. As we are evaluating based on database results and not the Cypher statements themselves, we need to have a running database with relevant information that we can use. In this blog post, we will use the <a class="af ny" href="http://ndbox.neo4j.com/?usecase=recommendations" rel="noopener ugc nofollow" target="_blank">recommendations project in Neo4j Sandbox</a>. The recommendations project uses the <a class="af ny" href="https://grouplens.org/datasets/movielens/" rel="noopener ugc nofollow" target="_blank">MovieLens dataset</a>, which contains movies, actors, ratings, and more information. The recommendations project is also available as readonly access on the demo server, which means you don’t have to create a new database instance if you don’t want to.</p><figure class="mm mn mo mp mq mr mj mk paragraph-image"><div role="button" tabindex="0" class="ms mt ed mu bh mv"><div class="mj mk pm"><img src="../Images/62d91638c35854e38d31dbd85606726e.png" data-original-src="https://miro.medium.com/v2/resize:fit:1400/format:webp/1*vZhsF_JltO3ycDyBHfgIGw.png"/></div></div><figcaption class="mx my mz mj mk na nb bf b bg z dx">Recommendations project graph schema. Image by the author.</figcaption></figure><p id="8632" class="pw-post-body-paragraph nc nd fq ne b go nf ng nh gr ni nj nk nl nm nn no np nq nr ns nt nu nv nw nx fj bk">In this example, I used GPT-4 to come up with suggestions for the training dataset, and then went through them and corrected them where needed. We will use only 27 testing pairs. In practice, you probably want to use at least a couple hundred examples.</p><pre class="mm mn mo mp mq pn po pp bp pq bb bk"><span id="3f09" class="pr ok fq po b bg ps pt l pu pv">data = [<br/>    {<br/>        "question": "How many movies were released in 1995?",<br/>        "cypher": "MATCH (m:Movie) WHERE m.Year = 1995 RETURN count(*) AS result",<br/>    },<br/>    {<br/>        "question": "Who directed the movie Inception?",<br/>        "cypher": "MATCH (m:Movie {title: 'Inception'})&lt;-[:DIRECTED]-(d) RETURN d.name",<br/>    },<br/>    {<br/>        "question": "Which actors played in the movie Casino?",<br/>        "cypher": "MATCH (m:Movie {title: 'Casino'})&lt;-[:ACTED_IN]-(a) RETURN a.name",<br/>    },<br/>    {<br/>        "question": "How many movies has Tom Hanks acted in?",<br/>        "cypher": "MATCH (a:Actor {name: 'Tom Hanks'})-[:ACTED_IN]-&gt;(m:Movie) RETURN count(m)",<br/>    },<br/>    {<br/>        "question": "List all the genres of the movie Schindler's List",<br/>        "cypher": "MATCH (m:Movie {title: 'Schindler\\'s List'})-[:IN_GENRE]-&gt;(g:Genre) RETURN g.name",<br/>    },<br/>    ...<br/>]</span></pre><h2 id="9b62" class="oj ok fq bf ol om on oo op oq or os ot nl ou ov ow np ox oy oz nt pa pb pc pd bk">Generating Cypher statements</h2><p id="f55e" class="pw-post-body-paragraph nc nd fq ne b go pe ng nh gr pf nj nk nl pg nn no np ph nr ns nt pi nv nw nx fj bk">We will be using <a class="af ny" href="https://www.langchain.com/" rel="noopener ugc nofollow" target="_blank">LangChain</a> to generate Cypher statements. The <a class="af ny" href="https://python.langchain.com/docs/use_cases/graph/graph_cypher_qa" rel="noopener ugc nofollow" target="_blank">Neo4jGraph</a> object in LangChain establishes the connection to Neo4j and retrieves its schema information.</p><pre class="mm mn mo mp mq pn po pp bp pq bb bk"><span id="d9ac" class="pr ok fq po b bg ps pt l pu pv">graph = Neo4jGraph()<br/>print(graph.schema)<br/># Node properties are the following:<br/># Movie {posterEmbedding: LIST, url: STRING, runtime: INTEGER, revenue: INTEGER, budget: INTEGER, plotEmbedding: LIST, imdbRating: FLOAT, released: STRING, countries: LIST, languages: LIST, plot: STRING, imdbVotes: INTEGER, imdbId: STRING, year: INTEGER, poster: STRING, movieId: STRING, tmdbId: STRING, title: STRING}<br/># Genre {name: STRING}<br/># User {userId: STRING, name: STRING}<br/># Actor {url: STRING, bornIn: STRING, bio: STRING, died: DATE, born: DATE, imdbId: STRING, name: STRING, poster: STRING, tmdbId: STRING}<br/># Director {url: STRING, bornIn: STRING, born: DATE, died: DATE, tmdbId: STRING, imdbId: STRING, name: STRING, poster: STRING, bio: STRING}<br/># Person {url: STRING, bornIn: STRING, bio: STRING, died: DATE, born: DATE, imdbId: STRING, name: STRING, poster: STRING, tmdbId: STRING}<br/># Relationship properties are the following:<br/># RATED {rating: FLOAT, timestamp: INTEGER}<br/># ACTED_IN {role: STRING}<br/># DIRECTED {role: STRING}<br/># The relationships are the following:<br/># (:Movie)-[:IN_GENRE]-&gt;(:Genre)<br/># (:User)-[:RATED]-&gt;(:Movie)<br/># (:Actor)-[:ACTED_IN]-&gt;(:Movie)<br/># (:Actor)-[:DIRECTED]-&gt;(:Movie)<br/># (:Director)-[:DIRECTED]-&gt;(:Movie)<br/># (:Director)-[:ACTED_IN]-&gt;(:Movie)<br/># (:Person)-[:ACTED_IN]-&gt;(:Movie)<br/># (:Person)-[:DIRECTED]-&gt;(:Movie)</span></pre><p id="1dbd" class="pw-post-body-paragraph nc nd fq ne b go nf ng nh gr ni nj nk nl nm nn no np nq nr ns nt nu nv nw nx fj bk">The schema contains node labels, their properties, and the corresponding relationships. Next, we will use the LangChain expression language to define a prompt sent to the LLM with instructions to translate the natural language to a Cypher statement that retrieves relevant information to answer the question. Visit the <a class="af ny" href="https://python.langchain.com/docs/expression_language/" rel="noopener ugc nofollow" target="_blank">official documentation</a> for more details on the LangChain expression language.</p><pre class="mm mn mo mp mq pn po pp bp pq bb bk"><span id="df81" class="pr ok fq po b bg ps pt l pu pv">cypher_template = """Based on the Neo4j graph schema below, <br/>write a Cypher query that would answer the user's question.<br/>Return only Cypher statement, no backticks, nothing else.<br/>{schema}<br/><br/>Question: {question}<br/>Cypher query:"""  # noqa: E501<br/><br/>cypher_prompt = ChatPromptTemplate.from_messages(<br/>    [<br/>        (<br/>            "system",<br/>            "Given an input question, convert it to a Cypher query. No pre-amble.",<br/>        ),<br/>        ("human", cypher_template),<br/>    ]<br/>)<br/><br/>cypher_chain = (<br/>    RunnablePassthrough.assign(<br/>        schema=lambda _: graph.get_schema,<br/>    )<br/>    | cypher_prompt<br/>    | llm.bind(stop=["\nCypherResult:"])<br/>    | StrOutputParser()<br/>)</span></pre><p id="7dfd" class="pw-post-body-paragraph nc nd fq ne b go nf ng nh gr ni nj nk nl nm nn no np nq nr ns nt nu nv nw nx fj bk">If you are familiar with conversational LLMs, you can spot the <strong class="ne fr">system</strong> and <strong class="ne fr">human</strong> message definitions. As you can observe, we put both the graph schema as well as user question into the human message. The exact prompt engineering instructions to generate Cypher statements is not a solved problem, which means that there could be some improvements made here. Using an evaluation process, you could see what works best for the particular LLM. In this example, we are using <strong class="ne fr">gpt-4-turbo</strong>.</p><p id="043a" class="pw-post-body-paragraph nc nd fq ne b go nf ng nh gr ni nj nk nl nm nn no np nq nr ns nt nu nv nw nx fj bk">We can test the Cypher generation with the following example:</p><pre class="mm mn mo mp mq pn po pp bp pq bb bk"><span id="4ab9" class="pr ok fq po b bg ps pt l pu pv">response = cypher_chain.invoke(<br/>    {<br/>        "question": "How many movies have the keyword 'love' in the title and a runtime under 2 hours?"<br/>    }<br/>)<br/>print(response)<br/># MATCH (m:Movie) <br/># WHERE m.title CONTAINS 'love' AND m.runtime &lt; 120 <br/># RETURN count(m) as NumberOfMovies</span></pre><p id="2cd5" class="pw-post-body-paragraph nc nd fq ne b go nf ng nh gr ni nj nk nl nm nn no np nq nr ns nt nu nv nw nx fj bk">We can observe that gpt-4-turbo is somewhat decent at translating natural language to Cypher statements. Let’s now define the evaluation process.</p><pre class="mm mn mo mp mq pn po pp bp pq bb bk"><span id="d2cb" class="pr ok fq po b bg ps pt l pu pv"># Iterate over each row with tqdm to show a progress bar<br/>for index, row in tqdm(df.iterrows(), total=df.shape[0]):<br/>    # Fetch data based on the test Cypher statement<br/>    true_data = graph.query(row["cypher"])<br/>    # Generate 3 Cypher statement and fetch data<br/>    example_generated_cyphers = []<br/>    example_eval_datas = []<br/>    for _ in range(3):<br/>        cypher = cypher_chain.invoke({"question": row["question"]})<br/>        example_generated_cyphers.append(cypher)<br/>        # Fetch data based on the generated Cypher statement<br/>        try:<br/>            example_eval_datas.append(graph.query(cypher))<br/>        except ValueError:  # Handle syntax error<br/>            example_eval_datas.append([{"id": "Cypher syntax error"}])<br/><br/>    # These metrics require only the first cypher/response<br/>    jaro_winkler = get_jw_distance(row["cypher"], example_generated_cyphers[0])<br/>    pass_1 = (<br/>        1<br/>        if df_sim_pair(<br/>            (row["cypher"], true_data),<br/>            (example_generated_cyphers[0], example_eval_datas[0]),<br/>        )<br/>        == 1<br/>        else 0<br/>    )<br/>    jaccard = df_sim_pair(<br/>        (row["cypher"], true_data),<br/>        (example_generated_cyphers[0], example_eval_datas[0]),<br/>    )<br/>    # Pass@3 check all 3 responses<br/>    pass_3 = 1 if any(<br/>        df_sim_pair((row["cypher"], true_data), (gen_cypher, eval_data)) == 1<br/>        for gen_cypher, eval_data in zip(example_generated_cyphers, example_eval_datas)<br/>    ) else 0<br/><br/>    # Append the results to their respective lists<br/>    generated_cyphers.append(example_generated_cyphers)<br/>    true_datas.append(true_data)<br/>    eval_datas.append(example_eval_datas)<br/>    jaro_winklers.append(jaro_winkler)<br/>    pass_1s.append(pass_1)<br/>    pass_3s.append(pass_3)<br/>    jaccards.append(jaccard)</span></pre><p id="bcf2" class="pw-post-body-paragraph nc nd fq ne b go nf ng nh gr ni nj nk nl nm nn no np nq nr ns nt nu nv nw nx fj bk"><em class="pw">Running this code took about 5 minutes as we need to generate 81 responses to calculate the pass@3 metric.</em></p><p id="376f" class="pw-post-body-paragraph nc nd fq ne b go nf ng nh gr ni nj nk nl nm nn no np nq nr ns nt nu nv nw nx fj bk">The code is slightly lengthy. However, the gist is quite simple to understand. We iterate over all the rows in the data frame that stores the testing examples. Next, we generate three Cypher queries for each training example and retrieve corresponding data from the database. What follows is then calculating the relevant metrics and storing them in lists so that we can evaluate and visualize them. We didn’t include the helper functions in the blog post because, in my opinion, reviewing each metric code implementation isn’t relevant. All of these functions, however, are included in the <a class="af ny" href="https://github.com/tomasonjo/blogs/blob/master/llm/evaluating_cypher.ipynb" rel="noopener ugc nofollow" target="_blank">notebook</a>.</p><p id="1b09" class="pw-post-body-paragraph nc nd fq ne b go nf ng nh gr ni nj nk nl nm nn no np nq nr ns nt nu nv nw nx fj bk">Let’s now evaluate the results.</p><figure class="mm mn mo mp mq mr mj mk paragraph-image"><div role="button" tabindex="0" class="ms mt ed mu bh mv"><div class="mj mk px"><img src="../Images/8aaa45fbcae5ebb94cecbd739f9b8a76.png" data-original-src="https://miro.medium.com/v2/resize:fit:1400/format:webp/1*K8nYat4AlHAbxDT3qde_wQ.png"/></div></div><figcaption class="mx my mz mj mk na nb bf b bg z dx">Evaluation of LLM-generated Cypher statements. Image by the author.</figcaption></figure><p id="0f79" class="pw-post-body-paragraph nc nd fq ne b go nf ng nh gr ni nj nk nl nm nn no np nq nr ns nt nu nv nw nx fj bk">The evaluation is based on four different metrics:</p><ol class=""><li id="7f05" class="nc nd fq ne b go nf ng nh gr ni nj nk nl nm nn no np nq nr ns nt nu nv nw nx py oa ob bk"><strong class="ne fr">Jaro-Winkler</strong>: This metric shows a high average of 0.89, indicating that the LLMs generated Cypher queries that are very similar to the correct Cypher queries on a string level.</li><li id="2bcc" class="nc nd fq ne b go oc ng nh gr od nj nk nl oe nn no np of nr ns nt og nv nw nx py oa ob bk"><strong class="ne fr">Pass@1</strong>: The average score here is 0.48, suggesting that nearly half of the generated Cypher queries returned the exact same results as the correct query when each query is evaluated independently.</li><li id="cd39" class="nc nd fq ne b go oc ng nh gr od nj nk nl oe nn no np of nr ns nt og nv nw nx py oa ob bk"><strong class="ne fr">Pass@3</strong>: With an average of 0.63, this metric indicates an improvement over Pass@1. This suggests that while the LLM may not always get the query right on the first attempt, it often comes up with a correct version within three tries.</li><li id="d46e" class="nc nd fq ne b go oc ng nh gr od nj nk nl oe nn no np of nr ns nt og nv nw nx py oa ob bk"><strong class="ne fr">Jaccard Similarity</strong>: The average score of 0.53 is the lowest among the metrics but still indicates that more than half of the time, the sets of results from the LLM-generated Cypher queries share more than half of their elements with the sets from the correct queries.</li></ol><p id="5458" class="pw-post-body-paragraph nc nd fq ne b go nf ng nh gr ni nj nk nl nm nn no np nq nr ns nt nu nv nw nx fj bk">Overall, these metrics suggest that LLMs are decent at generating Cypher queries that are similar to the correct ones and often produce functionally equivalent results, especially when given multiple attempts. However, there is still room for improvement, particularly in generating the correct query on the first attempt. Additionally there is also room for improvement in the evaluation process. Let’s take a look at one example:</p><pre class="mm mn mo mp mq pn po pp bp pq bb bk"><span id="6206" class="pr ok fq po b bg ps pt l pu pv">row = df.iloc[24]<br/># Print the desired information<br/>print("Question:", row["question"], "\n")<br/>print("True Cypher:", row["cypher"], "\n")<br/>print("Generated Cypher", row["generated_cypher"][0], "\n")<br/><br/># Question: Which directors have never had a movie with a rating below 6.0? <br/># True Cypher: <br/># MATCH (d:Director)-[:DIRECTED]-&gt;(m:Movie) <br/># WITH d, MIN(m.imdbRating) AS lowestRating WHERE lowestRating &gt;= 6.0 <br/># RETURN d.name, lowestRating <br/><br/># Generated Cypher<br/># MATCH (d:Director)-[:DIRECTED]-&gt;(m:Movie)<br/># WHERE NOT EXISTS {<br/>#     MATCH (d)-[:DIRECTED]-&gt;(m2:Movie)<br/>#     WHERE m2.imdbRating &lt; 6.0<br/># }<br/># RETURN DISTINCT d.name </span></pre><p id="5c81" class="pw-post-body-paragraph nc nd fq ne b go nf ng nh gr ni nj nk nl nm nn no np nq nr ns nt nu nv nw nx fj bk">For the question of which directors never had a movie with a rating below 6.0, the LLM did a decent job of getting the results. It used a different approach than in the test dataset, but that’s not a problem, as it should get the same results. However, we returned both the title and the movie’s rating in the testing data. On the other hand, the LLM produced only the titles and not the ratings. We can’t blame it, as it simply followed the instructions. Still, you must know that the pass@1 score is 0 in this example, while the Jaccard similarity is only 0.5. Therefore, you have to very careful how you construct the testing dataset, both how you define the prompts as well as the corresponding Cypher statements.</p><p id="947a" class="pw-post-body-paragraph nc nd fq ne b go nf ng nh gr ni nj nk nl nm nn no np nq nr ns nt nu nv nw nx fj bk">Another characteristic of LLMs is that they are non-deterministic, meaning you can get different results on every run. Let’s run the evaluation three times in sequence now. This evaluation takes around 15 minutes.</p><figure class="mm mn mo mp mq mr mj mk paragraph-image"><div role="button" tabindex="0" class="ms mt ed mu bh mv"><div class="mj mk pz"><img src="../Images/88a9e606be5ed7980e371f818c34ad89.png" data-original-src="https://miro.medium.com/v2/resize:fit:1400/format:webp/1*dCBbPSit3Y25_o0Px9CkeA.png"/></div></div><figcaption class="mx my mz mj mk na nb bf b bg z dx">Evaluation of LLM-generated Cypher statements. Image by the author.</figcaption></figure><p id="e63f" class="pw-post-body-paragraph nc nd fq ne b go nf ng nh gr ni nj nk nl nm nn no np nq nr ns nt nu nv nw nx fj bk">The bar chart highlights the non-deterministic nature of LLMs. The Jaro-Winkler scores are consistently high across all runs, showing minor fluctuations between 0.88 and 0.89, which indicates stable string similarity of the generated queries. However, for Pass@1, there’s a notable variation, with the first run scoring 0.52, and subsequent runs showing scores of 0.59 and 0.48. Pass@3 scores exhibit less variance, hovering around 0.56 to 0.63, suggesting that multiple attempts yield more consistent correct results.</p><h2 id="580d" class="oj ok fq bf ol om on oo op oq or os ot nl ou ov ow np ox oy oz nt pa pb pc pd bk">Conclusion</h2><p id="45f0" class="pw-post-body-paragraph nc nd fq ne b go pe ng nh gr pf nj nk nl pg nn no np ph nr ns nt pi nv nw nx fj bk">Through this blog post, we’ve learned that LLMs like GPT-4 have a promising capacity for generating Cypher queries, yet the technology isn’t foolproof. The evaluation framework presented offers a detailed, quantitative evaluation of LLM performance, allowing you to continuously experiment and update prompt engineering and other steps needed to generate valid and accurate Cypher statements. Additionally, it shows how the non-deterministic nature of LLMs affects the performance from one evaluation to another. Therefore, you can expect similar non-deterministic behavior in production.</p><p id="243f" class="pw-post-body-paragraph nc nd fq ne b go nf ng nh gr ni nj nk nl nm nn no np nq nr ns nt nu nv nw nx fj bk">The code is available on <a class="af ny" href="https://github.com/tomasonjo/blogs/blob/master/llm/evaluating_cypher.ipynb" rel="noopener ugc nofollow" target="_blank">GitHub</a>.</p><h2 id="3e60" class="oj ok fq bf ol om on oo op oq or os ot nl ou ov ow np ox oy oz nt pa pb pc pd bk">Dataset</h2><p id="0f19" class="pw-post-body-paragraph nc nd fq ne b go pe ng nh gr pf nj nk nl pg nn no np ph nr ns nt pi nv nw nx fj bk">F. Maxwell Harper and Joseph A. Konstan. 2015. The MovieLens Datasets: History and Context. ACM Transactions on Interactive Intelligent Systems (TiiS) 5, 4: 19:1–19:19. <a class="af ny" href="https://doi.org/10.1145/2827872" rel="noopener ugc nofollow" target="_blank">https://doi.org/10.1145/2827872</a></p></div></div></div></div>    
</body>
</html>