["```py\nbirth_year,sex,marital_status,yearly_household_income_percentile,number_of_toddlers,number_of_teens,highest_education,monthly_spend_on_wine,monthly_spend_on_vegetables,monthly_spend_on_toys,last_month_coupon_use\n1975,F,married,65,1,0,masters,30,65,20,high\n1992,M,single,30,0,0,bachelors,15,40,0,none\n1980,F,married,80,0,2,bachelors,50,80,85,low \n1968,M,divorced,45,0,0,high_school,45,50,0,high\n1990,F,single,25,0,0,associates,10,35,0,low\n1985,M,married,90,2,1,phd,80,100,120,high\n2000,F,single,40,0,0,bachelors,25,55,0,none\n1972,M,married,70,0,1,masters,60,70,40,low\n1988,F,married,55,1,0,associates,20,40,30,high\n1970,M,single,60,0,0,high_school,35,60,0,none\n```", "```py\nFresh Lettuce\nDiapers\nIrish whiskey\nlaundry detergent\nChips\nSpaghetti cans (ready to eat)\nMinecraft Video Game\nMascara\nToilet Paper (best value)\nWagyu beef steak\nOrganic avocados\nCigarettes\n```", "```py\nprofiler = Agent(\n  role='profiler',\n  goal='''From limited data, you logically deduct conclusions about people.''',\n  backstory='You are an expert psychologist with decades of experience.',\n  llm=llm,\n  verbose=True,\n  allow_delegation=True\n)\nproduct_specialist = Agent(\n  role='product specialist',\n  goal='''Match the product to the customer''',\n  backstory='You have exceptional knowledge of the products and can say\n             how valuable they are to a customer.',\n  llm=llm,\n  verbose=True,\n  allow_delegation=True\n)\n\nChief_Promotional_Director = Agent(\n    role=\"Chief Promotion Director\",\n    goal='''\n     Oversee the work done by your team to make sure it's the best possible\n     and aligned with the product's goals, review, approve, ask clarifying\n     question or delegate follow up work if necessary to make decisions''',\n    backstory='''\n     You're the Chief Promotion Officer of a large retailer. You're\n     launching a personalized ad campaign, trying to make sure your team\n     is crafting the best possible content for the customer.''',\n    tools=[],\n    llm=llm,\n    verbose=True\n)\n```", "```py\nselect_3_products_task = f'''You're creating a targeted marketing campaign\ntailored to what we know about our customers.\nFor each customer, we have to choose exactly three products to promote \nin the next campaign. Make sure the selection is the best possible and\naligned with the customer. Review, approve, ask clarifying question or\ndelegate follow up work if necessary to make decisions. When delegating\nwork send the full draft as part of the information.\nThis is the list of all the products participating in the campaign: {products}.\nThis is all we know so far from the customer: {customer_description}.\nTo start this campaign we will need to build first an understanding of our\ncustomer. Once we have a profile about the customers interests, lifestyle and\nmeans and needs, we have to select exactly three products that have the\nhighest chance to be bought by them.\nYour final answer MUST be exactly 3 products from the list, each with a short\ndescription why it matches with this customer. '''\n```", "```py\ncreative_content_creator_agent = Agent(\n   role=\"Creative Content Creator\",\n   goal=dedent(\"\"\"\\\n    Develop compelling and innovative content\n    for ad campaigns, with a focus customer specific ad copies.\"\"\"),\n   backstory=dedent(\"\"\"\\\n    As a Creative Content Creator at a top-tier digital marketing\n    agency, you excel in crafting advertisements that resonate with\n    potential customers. Your expertise lies in turning marketing\n    strategies into engaging stories that capture attention and\n    inspire buying action.\"\"\"),\n   llm=llm,\n   verbose=True\n  )\n```", "```py\nget_ad_campaign_written_task = f'''\nYou're creating a targeted marketing campaign tailored to what we know \nabout our customers.\nFor each customer, we have chosen three products to promote in the next\ncampaign. This selection is tailored specifically to the customer: {selection}\nTo end this campaign succesfully we will need a promotional message \nadvertising these products to the customer with the ultimate intent that \nthey buy from us. This message should be around 3 paragraphs, so that it can\nbe easily integrated into the full letter. For example:\nTired of making dinner, get our best ready made canned tuna.\nYour lifestyle deserves a taste of this fresh lobster.\nIn the weekends, go on a day trip with the kids with these new lunch box containers.\n\nYou need to review, approve, and delegate follow up work if necessary to \nhave the complete promotional message. When delegating work send the full\ndraft as part of the information.\nYour final answer MUST include the 3 products from the list,\neach with a short promotional message.'''\n```", "```py\nThought: Do I need to use a tool? Yes\nAction: Ask question to co-worker\nAction Input: profiler|Can you provide a customer profile based on the given demographic and behavioral data?|The customer was born in 1968\\. Its sex is M. Its marital status is divorced. Its yearly household income percentile is 45\\. The customer has 0 toddlers. The customer has 0 teenage kids. The customer highest education is high_school. The customer spends on average 45 $ on wine. The customer spends on average 50 $ on vegetables. The customer spends on average 0 $ on toys. The customer's coupon use is high.\n\nObservation: The profiler responds with: Our customer is a 54-year-old divorced man with a mid-level income. He has no children living with him. He has a high school education. He enjoys wine and vegetables, and does not spend on toys. He is likely to be budget-conscious and looking for deals, given his high coupon use.\n\nThought: Do I need to use a tool? Yes\nAction: Ask question to co-worker\nAction Input: product specialist|Which three products would you recommend for this customer, based on his profile?|54-year-old divorced man with a mid-level income, high school education, enjoys wine and vegetables, budget-conscious, and uses coupons.\n\nObservation: The product specialist responds with: Based on the customer's profile, I would recommend:\n1\\. Laundry detergent: A necessary household item, and we can offer a deal or discount to appeal to his budget-conscious nature.\n2\\. Fresh lettuce and vegetables: Given his interest in vegetables, promoting fresh produce is a good fit.\n3\\. Wine or Irish whiskey: Since he spends a significant amount on wine, promoting a higher-end option like Irish whiskey could be appealing, especially if we offer a discount.\n\nThought: Do I need to use a tool? No\nFinal Answer:\n1\\. Laundry detergent : A necessary household item, and we can offer a deal or discount to appeal to his budget-conscious nature.\n2\\. Fresh lettuce and vegetables : Given his interest in vegetables, promoting fresh produce is a good fit.\n3\\. Irish whiskey : Since he spends a significant amount on wine, promoting a higher-end option like Irish whiskey could be appealing, especially if we offer a discount.\n\nObservation: I have provided the three recommended products for the customer based on their profile.\n```", "```py\n1990,F,single,25,0,0,associates,10,35,0,low\n```", "```py\n1985,M,married,90,2,1,phd,80,100,120,high\n```"]