["```py\nPROMPT = \"\"\"\n\nHUMAN: <context>\n{context}\n</context>\n\nWhat is the most fun thing to do in San Francisco based on the context? Don't give information outside the document or repeat our findings\n\nAssistant: here is the most relevant sentence in the context:\"\"\"\n```", "```py\nSIMPLE_TEMPLATE = ''' \n   You are a helpful AI bot that answers questions for a user. Keep your responses short and direct. \n   The following is a set of context and a question that will relate to the context.\n   #CONTEXT\n   {context}\n   #ENDCONTEXT\n\n   #QUESTION\n   {question} Don’t give information outside the document or repeat your findings. If the information is not available in the context respond UNANSWERABLE\n```", "```py\nANTHROPIC_TEMPLATE_ORIGINAL = ''' Human: You are a close-reading bot with a great memory who answers questions for users. I’m going to give you the text of some essays. Amidst the essays (“the haystack”) I’ve inserted a sentence (“the needle”) that contains an answer to the user’s question. \nHere's the question:\n   <question>{question}</question>\n   Here’s the text of the essays. The answer appears in it somewhere.\n   <haystack>\n   {context}\n   </haystack>\n   Now that you’ve read the context, please answer the user's question, repeated one more time for reference:\n   <question>{question}</question>\n\n   To do so, first find the sentence from the haystack that contains the answer (there is such a sentence, I promise!) and put it inside <most_relevant_sentence> XML tags. Then, put your answer in <answer> tags. Base your answer strictly on the context, without reference to outside information. Thank you. \n   If you can’t find the answer return the single word UNANSWERABLE\n   Assistant: '''\n```", "```py\nANTHROPIC_TEMPLATE_REV2 = ''' Human: You are a close-reading bot with a great memory who answers questions for users. I'm going to give you the text of some essays. Amidst the essays (\"the haystack\") I've inserted a sentence (\"the needle\") that contains an answer to the user's question. \nHere's the question:\n   <question>{question}</question>\n   Here's the text of the essays. The answer appears in it somewhere.\n   <haystack>\n   {context}\n   </haystack>\n   Now that you've read the context, please answer the user's question, repeated one more time for reference:\n   <question>{question}</question>\n\n   To do so, first find the sentence from the haystack that contains the answer (there is such a sentence, I promise!) and put it inside <most_relevant_sentence> XML tags. Then, put your answer in <answer> tags. Base your answer strictly on the context, without reference to outside information. Thank you. \n   If you can't find the answer return the single word UNANSWERABLE\n   Assistant: Here is the most relevant sentence in the context:'''\n```"]