["```py\nSIMPLE_TEMPLATE_SPELLING = \"\"\"\n  You are a helpful AI bot that checks for grammatic, spelling and typing errors in a document context. \n  You are going to score the document based on the percent of grammatical and typing errors. The score should be between {templ_high} and {templ_low}. \n  A {templ_low} score will be no grammatical errors in any word, a score of {templ_20_perc} will be 20% of words have errors, a {templ_50_perc} score will be 50% errors, a score of {templ_70_perc} is 70%, and a {templ_high} will be all words in context have grammatical errors. \n  The following is the document context.\n\n  #CONTEXT\n  {context}\n  #ENDCONTEXT\n\n  #QUESTION\n  Please return a score between {templ_high} and {templ_low}, with a case of {templ_high} being all words have a grammatical error and {templ_low} being no words have grammatical or spelling errors. \n  You will return no other text or language besides the score. Only return the score.\n  Please\n```", "```py\nSIMPLE_TEMPLATE_FRUSTRATION = \"\"\"\n  You are a helpful AI bot that detects frustrated conversations. You are going to score the document based on the percent of sentences where the writer expresses frustration.\n  The score should be between {templ_high} and {templ_low}.\n  A {templ_low} will indicate almost no frustrated sentences, a score of {templ_20_perc} will be 20% of sentences express frustration, a {templ_50_perc} will be 50% of sentences express frustration, a score of {templ_70_perc} is 70%, and a {templ_high} score will be all the sentences express frustration. \n\n...\n\"\"\"\n```", "```py\nSIMPLE_TEMPLATE_SADNESS = \"\"\"\n  You are a helpful AI bot that detects sadness and sorrow in writing. You are going to score the document based on the percent of sentences where the writer expresses sadness or sorrow.\n  The score should be between {templ_high} and {templ_low}.\n  A {templ_low} will indicate almost no sentences that have sadness or sorrow, a score of {templ_20_perc} will be 20% of sentences express sadness or sorrow, a {templ_50_perc} will be 50% of sentences express sadness or sorrow, a score of {templ_70_perc} is 70%, and a {templ_high} score will be all the sentences express sadness or sorrow.\n\n...\n\"\"\"\n```"]