["```py\n1 **User**: “Please improve the sorting function I wrote from the uploaded file”\n2 **System_prompt_for_coder**: “You are a SW developer, you help the user to \n  develop …”\n3 **Coding_agent**: “read_file_function”\n4 **Function_response**: “coding snippet: ```", "```py”\n5 **System_prompt_for_coder**: “You are a SW developer, you help the user to\n  develop …”\n6 **Coding_agent**: “I’ve improved your code by adding … and … to your code, \n  here is the new function …”\n7 **System_prompt_for_reviewer**: “you are a SW code reviewer, you …”\n8 **Code_reviewer_agent**: “After reviewing the improved code, there \n  are a few more things that I would add to the code …\"\n9 **System_prompt_for_coder**: “you are a SW developer, you help the user to \n  develop …”\n10 **Coding_agent**: “ … ”\n```", "```py\n1) user: \"I visited dr. Fauci on Thursday, and got diagnosed with …\"\n2) system: \"Extract all medically relevant info from the user prompt\"\n```", "```py\n 1) system: \"Extract all medically relevant info from the user prompt\"\n2) user: \"I visited dr. Fauci on Thursday, and got diagnosed with …\"\n```", "```py\n#1 **User**: \n  \"What is the meaning of the universe?\"\n#2 **System**: \n  \"You're a philosopher; before you answer, step back and \n  reflect on what the user's question implies.\"\n#3 **Agent_philo**: \n  \"Reflecting on this question, one can consider the universe \n  through various philosophical lenses - existentialism views \n  it as a canvas for creating personal meaning, while cosmology \n  sees it as a playground for understanding physical laws. This \n  interplay between human perception and scientific exploration \n  is central to understanding our query.\"\n#4 **System**: \n  \"You're a philosopher, and you just reflected deeply on the \n  question posed by the user. Use that insightful reflection to \n  craft a comprehensive answer.\"\n#5 **Agent_philo**: \n  \"From an existentialist perspective, the meaning of the universe \n  is a personal journey, where each individual constructs their own \n  meaning through choices and life experiences. In contrast, from a \n  cosmological viewpoint, it is about exploring and understanding \n  the vast, intricate laws that govern the cosmos. These perspectives \n  help us grasp the multifaceted nature of our universe, blending our \n  existential quests with scientific inquiry.\"\n```"]