["```py\nfrom dotenv import load_dotenv\nfrom crewai import Agent, Task, Crew, Process\nfrom langchain_openai import ChatOpenAI\nfrom langchain.tools import tool\nimport re\n\n# Load your OPENAI_API_KEY from your .env file\nload_dotenv()\n\n# The model for the agents\nmodel = ChatOpenAI(model_name=\"gpt-4-turbo\", temperature=0.8)\n```", "```py\nfrom langchain_community.document_loaders import PyMuPDFLoader\nimport requests\n\n# Tool for loading and reading a PDF locally\n@tool\ndef fetch_pdf_content(pdf_path: str):\n    \"\"\"\n    Reads a local PDF and returns the content \n    \"\"\"\n    loader = PyMuPDFLoader(pdf_path)\n    data = loader.load()[0]\n    return data.page_content\n\n# Tool for loading a webpage\n@tool\ndef get_webpage_contents(url: str):\n    \"\"\"\n    Reads the webpage with a given URL and returns the page content\n    \"\"\"\n    try:\n        response = requests.get(url)\n        response.raise_for_status()  # Check for HTTP errors\n        return response.text\n    except requests.exceptions.RequestException as e:\n        return str(e)\n```", "```py\njob_crawler = Agent(\n    role='Job Description Crawler',\n    goal='Extract the relevant job description, requirements and qualificiations',\n    backstory='Specialized in parsing HTML and retrieving important information from it',\n    verbose=True,\n    tools=[get_webpage_contents],\n    allow_delegation=False,\n    llm=model\n)\n\ncv_modifier = Agent(\n    role='CV/Resume Writer',\n    goal='Write a top-notch CV that increases the chance of landing an interview',\n    backstory='Expert in writing CV that is best recieved by the recruiting team and HR',\n    verbose=True,\n    tools=[fetch_pdf_content],\n    allow_delegation=False,\n    llm=model\n)\n\ncover_letter_modifier = Agent(\n    role='Cover Letter Writer',\n    goal='Write an intriguing cover letter that boosts the chance of landing an interview',\n    backstory='Expert in writing Cover Letter that is best recieved by the recruiting team and HR',\n    verbose=True,\n    tools=[fetch_pdf_content],\n    allow_delegation=False,\n    llm=model\n)\n\nrecruiter = Agent(\n    role='Hiring Manager',\n    goal='Analyze how well a candidate is suited for a job description, given their CV and Cover Letter',\n    backstory='Experienced hiring manager with an especialization of giving feedback to job seekers',\n    verbose=True,\n    allow_delegation=False,\n    llm=model\n)\n```", "```py\ndef extract_job_information(page_url):\n    return Task(\n        description=f\"Given this url: {page_url}, extract the job description, and relative information about the job\",\n        agent=job_crawler,\n        expected_output=\"Key points of the job description, requirements, and qualifications needed for the job\",\n    )\n\ndef cv_modifying(cv_path):\n    return Task(\n        description=f\"Read the CV at this local path: {cv_path}, then\\\n        modify the keypoints and the order of the skills, to make it emphasize what is needded by the job.\\\n        Do NOT add any extra skill or new information, keep it honest.\",\n        agent=cv_modifier,\n        expected_output=\"A modified version of CV, tailor-made for the job description\",\n    )\n\ndef cover_letter_modifying(cv_path):\n    return Task(\n        description=f\"Read the cover letter at this local path: {cv_path},\\\n        then baseed on the provided job description by 'job_crawler' agent, \\\n        modify it to make it target the provided job description. Fill in the empty brackets with the company name.\\\n        Do NOT add any extra skill or new information, keep it honest.\",\n        agent=cover_letter_modifier,\n        expected_output=\"A modified version of cover letter, tailor-made for the job description\",\n    )\n\nevaluate = Task(\n        description=f\"Provided the modified CV and Cover Letter, and the key points of the job description,\\\n        give a score to the candidate from 0-100, based on how well suited they are for this job\",\n        agent=recruiter,\n        expected_output=\"Score in the range [0-100]\",\n    )\n```", "```py\n# USER INPUTS\ncover_letter_path = r'Cover Letter.pdf'\ncv_path = r'CV.pdf'\njob_url = [www.job.com]\n\nextract_job_information_task = extract_job_information(job_url)\ncv_modifying_task = cv_modifying(cv_path)\ncover_letter_modifying_task = cover_letter_modifying(cover_letter_path)\n\n# make the crew\ncrew = Crew(\n    agents=[job_crawler, cv_modifier, cover_letter_modifier, recruiter],\n    tasks=[\n    extract_job_information_task,\n    cv_modifying_task,\n    cover_letter_modifying_task,\n    evaluate\n    ],\n    verbose=2\n)\n\n# Let's start!\nresult = crew.kickoff()\n```", "```py\n > Entering new CrewAgentExecutor chain...\nI need to read the content of the cover letter from the provided PDF file to understand its structure and content. This will help modify it according to the job description.\n\nAction: fetch_pdf_content\nAction Input: {\"pdf_path\": \"Cover Letter.pdf\"} \n\nDear Hiring Manager, \n[Original cover letter, excluded for brevity]\nSincerely, \n\nThought:\nNow I have the content of the original cover letter. I need to tailor this cover letter to specifically address the job opening at Huawei's AI4Sec Research Team. I will adjust the content to highlight relevant experiences and skills that align with the job description provided.\n\nFinal Answer:\nDear Hiring Manager,\n[Modified cover letter, excluded for brevity]\nSincerely,\n```", "```py\nBased on the detailed review of Hesam Sheikh Hassani’s CV and \nCover Letter in relation to the key points of the job description\nfor the AI Researcher position at [Excluded Intentionally], I would score the candidate\na 92 out of 100\\. Hesam exhibits a strong academic and professional \nbackground in Artificial Intelligence, particularly in machine learning\nand deep learning, which aligns well with the requirements of the \n[Excluded Intentionally] Research Team at [Excluded Intentionally].\n\nHis experience with Large Language Models (LLMs) and his ability to \ncommunicate complex AI concepts effectively, as demonstrated through \nhis engagement on social media and articles, are particularly impressive\nand directly relevant to the position. His technical proficiency with tools \ncritical for the role, such as Git, Linux, Python, and advanced \nmachine learning algorithms, further strengthens his candidacy.\n\nHesam's previous roles and projects, such as the Agricultural Sorting Machine\nat PFK and his work on AI-on-Demand platforms, showcase his leadership skills\nand his capability to manage and execute AI projects, which is essential for\nthe role at [Excluded Intentionally]. His expressed eagerness to contribute to and learn from\n[Excluded Intentionally]’s research initiatives, along with his alignment with [Excluded Intentionally]’s core\nvalues of continuous improvement, AI integrity, and inclusiveness, make \nhim a strong fit culturally and professionally for the position.\n\nHis immediate availability and willingness to relocate also add to his \nsuitability for the role, ensuring a smooth transition and immediate \ncontribution to the team. Thus, given Hesam Sheikh Hassani’s strong \nalignment with both the technical and cultural aspects of the AI \nResearcher position at [Excluded Intentionally], \nhe is highly recommended for this role with a score of 92.\n```"]