["```py\n[{\n    \"model\": \"gpt-4o\",\n    \"api_key\": \"<YOUR API KEY>\",\n    \"azure_endpoint\": \"<YOUR ENDPOINT>\",\n    \"api_type\": \"azure\",\n    \"api_version\": \"2024-06-01\"\n}]\n```", "```py\npip install pyautogen\n```", "```py\nimport autogen\nfrom autogen.agentchat.contrib.capabilities.teachability import Teachability\nfrom autogen import ConversableAgent, UserProxyAgent\n\nconfig_list = autogen.config_list_from_json(\n    env_or_file=\"autogenconfig.json\", #the json file name that stores the config \n    file_location=\".\", #this means the file is in the same directory\n    filter_dict={\n        \"model\": [\"gpt-4o\"], #select a subset of the models in your config\n    },\n)\n```", "```py\nteachable_agent = ConversableAgent(\n    name=\"teachable_agent\",  # the name can't contain spaces\n    llm_config={\"config_list\": config_list, \"timeout\": 120, \"cache_seed\": None},  # in this example we disable caching but if it is enabled it caches API requests so that they can be reused when the same request is used\n) \n\nuser = UserProxyAgent(\n    name=\"user\",\n    human_input_mode=\"ALWAYS\", #I want to have full control over the code executed so I am setting human_input_mode to ALWAYS. Other options are NEVER and TERMINATE.\n    is_termination_msg=lambda x: True if \"TERMINATE\" in x.get(\"content\") else False, #setting a termination  message is VERY important because it tells the agent when to finish.\n    max_consecutive_auto_reply=0, #we don't need this agent to replies multiple times in a row\n    code_execution_config={\n        \"use_docker\": False\n    },  # If you are planning on running code look into setting use_docker=True. For this example I am not because then I have to walk through the docker setup, but it is safer than running the code directly.\n)\n```", "```py\nSIMPLE QUESTION RESPONSE\n===========================\n>>>>>>>> USING AUTO REPLY...\nteachable_agent (to user):\n\nTo address a power shortage of 30% effectively, it's crucial to prioritize models that are essential to critical operations, safety, and those that have the highest impact on productivity. Here are steps to determine which models to prioritize:\n\n1\\. **Identify Essential Systems:** Prioritize systems that are vital for safety, security, and essential operations. These might include:\n   - Emergency lighting\n   - Security systems (alarms, surveillance)\n   - Critical environmental controls (e.g., refrigeration for hazardous materials)\n   - Communication systems\n\n2\\. **Evaluate Impact on Core Operations:** Determine which models are crucial to the facility’s core functions. This can include machinery, servers, or any processes that are indispensable for maintaining productivity and operations.\n\n3\\. **Energy Efficiency:** Prioritize models and equipment that are more energy-efficient and can operate within the reduced power capacity.\n\n4\\. **Downtime Cost:** Consider the cost of downtime for each model. Prioritize those where downtime would result in significant financial losses or production delays.\n\nBased on these principles, here’s a generic prioritization framework:\n\n1\\. **Safety and Security Systems:**\n   - Emergency Lighting\n   - Fire Alarms and Sprinkler Systems\n   - Security Cameras and Sensors\n\n2\\. **Critical Operational Systems:**\n   - Essential Production Machinery (that cannot be shut down without major issues)\n   - Servers and IT Infrastructure (especially those critical for operations and data integrity)\n   - HVAC Systems (if necessary for maintaining safe operating conditions)\n\n3\\. **Support Systems:**\n   - Backup Power Systems (uninterruptible power supplies, generators)\n   - Communication Systems (both internal and external communication)\n\nEnsure that non-essential and high energy-consuming equipment is powered down or scheduled to operate during off-peak hours if possible.\n\nAlways re-evaluate periodically to ensure that the power allocation aligns with the dynamic needs of the facility. Communication with key stakeholders regarding priorities and decisions is also essential for smooth operations during a power shortage.\n\nCOMPLEX MULTISTEP QUESTION RESPONSE\n====================================\n>>>>>>>> USING AUTO REPLY...\nteachable_agent (to user):\n\nTo effectively manage a facility experiencing a 30% power shortage, we need to prioritize essential operations and consider the criticality and energy consumption of each machine. Here is a detailed breakdown:\n\n### Step 1: Identify Essential Operations\n\n1\\. **Critical Infrastructure**: Safety systems, security systems, and essential IT infrastructure.\n2\\. **Production Lines**: Machines involved in the primary production process.\n3\\. **Support Systems**: HVAC systems, lighting, and other ancillary equipment necessary to maintain a safe working environment.\n\n### Step 2: Categorize Machines by Importance and Energy Consumption\n\n#### A. Essential and High-Energy Machines\n\n1\\. **Safety and Security Systems**\n   - Fire alarms and sprinklers\n   - Surveillance cameras\n   - Security access controls\n\n2\\. **Primary Production Machines**\n   - Core production lines\n   - Central processing units or mainframe servers (for IT-heavy operations)\n\n3\\. **Critical Support Systems**\n   - Emergency lighting\n   - Essential HVAC systems (for maintaining operation-critical temperature and humidity)\n\n#### B. Non-Essential and High-Energy Machines\n\n1\\. **Secondary Production Lines**\n   - Non-primary or non-critical production lines\n   - Equipment used for non-essential or ancillary processes\n\n2\\. **Supplementary IT Infrastructure**\n   - Servers used for non-essential operations\n   - Backup systems that are not in immediate use\n\n3\\. **Non-Essential HVAC and Lighting**\n   - HVAC systems for non-critical areas\n   - Lighting in non-essential zones\n\n#### C. Non-Essential and Low-Energy Machines\n\n1\\. **Office Equipment**\n   - Computers, printers, and copiers in non-essential offices\n2\\. **Non-essential Lab or Research Equipment**\n   - Devices not directly linked to current essential tasks\n\n### Step 3: Prioritize Deactivation\n\n#### Immediate Deactivation\n\n1\\. **Non-Essential and High-Energy Machines**\n   - Secondary production lines\n   - Non-essential backup servers\n\n2\\. **Non-Essential HVAC and Lighting**\n   - HVAC in non-critical areas\n   - Non-essential lighting\n\n3\\. **Non-Essential Office Equipment**\n   - Printers, non-essential computers, and copiers\n\n#### Limited Usage\n\n1\\. **Essential and High-Energy Machines**\n   - Operate critical production lines at reduced capacity if possible\n   - Implement rotational operation schedules for essential processes\n\n2\\. **Critical Support Systems**\n   - Optimize HVAC settings (e.g., raising or lowering set points within acceptable ranges)\n   - Reduce lighting to minimum safety standards\n\n### Step 4: Implement Energy Conservation Measures\n\n1\\. **Optimize Operations**\n   - Utilize energy-efficient settings\n   - Implement energy-saving protocols and encourage staff to conserve energy\n\n2\\. **Scheduled Downtime**\n   - Plan for downtime during off-peak hours for essential machinery to balance the load\n\n3\\. **Regular Monitoring**\n   - Monitor energy consumption in real-time to make quick adjustments as needed\n\n### Summary\n\n#### Remain Active:\n1\\. Safety and security systems\n2\\. Main production lines\n3\\. Critical IT infrastructure\n4\\. Essential HVAC and lighting for operational areas\n\n#### Deactivate or Limit Use:\n1\\. Non-essential production lines\n2\\. Redundant IT systems\n3\\. Non-critical HVAC and lighting\n4\\. Office equipment in non-essential areas\n\n**Note**: These recommendations should be adjusted based on the specific operational requirements of your facility. Additionally, it could be beneficial to communicate these changes to all staff to ensure compliance and understanding.\n```", "```py\n #simple question\nuser.initiate_chat(teachable_agent, message=\"The facility is experiencing a power shortage of 40%. What models need to be prioritized?\", clear_history=True)\n#multistep complex question\nuser.initiate_chat(teachable_agent, message=\"The facility is experiencing a power shortage of 30%. Provide me a detailed breakdown of what machines should be deactivated and which machines should remain active.\", clear_history=True)\n```", "```py\nteachability = Teachability(\n    verbosity=0,  # 0 for basic info, 1 to add memory operations, 2 for analyzer messages, 3 for memo lists.\n    reset_db=True, # we want to reset the db because we are creating a new agent so we don't want any existing memories. If we wanted to use an existing memory store we would set this to false.\n    path_to_db_dir=\"./tmp/notebook/teachability_db\", #this is the default path you can use any path you'd like\n    recall_threshold=1.5,  # Higher numbers allow more (but less relevant) memos to be recalled.\n    max_num_retrievals=10 #10 is default bu you can set the max number of memos to be retrieved lower or higher\n)\n\nteachability.add_to_agent(teachable_agent)\n```", "```py\nbusiness_info = \"\"\"\n# This manufacturing plant manufactures the following vehicle parts:\n- Body panels (doors, hoods, fenders, etc.)\n- Engine components (pistons, crankshafts, camshafts)\n- Transmission parts\n- Suspension components (springs, shock absorbers)\n- Brake system parts (rotors, calipers, pads)\n\n# This manufactoring plant produces parts for the following models:\n- Ford F-150\n- Ford Focus\n- Ford Explorer\n- Ford Mustang\n- Ford Escape\n- Ford Edge\n- Ford Ranger\n\n# Equipment for Specific Automotive Parts and Their Uses\n\n## 1\\. Body Panels (doors, hoods, fenders, etc.)\n- Stamping presses: Form sheet metal into body panel shapes\n- Die sets: Used with stamping presses to create specific panel shapes\n- Hydraulic presses: Shape and form metal panels with high pressure\n- Robotic welding systems: Automate welding of body panels and structures\n- Laser cutting machines: Precisely cut sheet metal for panels\n- Sheet metal forming machines: Shape flat sheets into curved or complex forms\n- Hemming machines: Fold and crimp edges of panels for strength and safety\n- Metal finishing equipment (grinders, sanders): Smooth surfaces and remove imperfections\n- Paint booths and spraying systems: Apply paint and protective coatings\n- Drying ovens: Cure paint and coatings\n- Quality control inspection systems: Check for defects and ensure dimensional accuracy\n\n## 2\\. Engine Components (pistons, crankshafts, camshafts)\n- CNC machining centers: Mill and drill complex engine parts\n- CNC lathes: Create cylindrical parts like pistons and camshafts\n- Boring machines: Enlarge and finish cylindrical holes in engine blocks\n- Honing machines: Create a fine surface finish on cylinder bores\n- Grinding machines: Achieve precise dimensions and smooth surfaces\n- EDM equipment: Create complex shapes in hardened materials\n- Forging presses: Shape metal for crankshafts and connecting rods\n- Die casting machines: Produce engine blocks and cylinder heads\n- Heat treatment furnaces: Alter material properties for strength and durability\n- Quenching systems: Rapidly cool parts after heat treatment\n- Balancing machines: Ensure rotating parts are perfectly balanced\n- Coordinate Measuring Machines (CMMs): Verify dimensional accuracy\n\n## 3\\. Transmission Parts\n- Gear cutting machines: Create precise gear teeth on transmission components\n- CNC machining centers: Mill and drill complex transmission housings and parts\n- CNC lathes: Produce shafts and other cylindrical components\n- Broaching machines: Create internal splines and keyways\n- Heat treatment equipment: Harden gears and other components\n- Precision grinding machines: Achieve extremely tight tolerances on gear surfaces\n- Honing machines: Finish internal bores in transmission housings\n- Gear measurement systems: Verify gear geometry and quality\n- Assembly lines with robotic systems: Put together transmission components\n- Test benches: Evaluate completed transmissions for performance and quality\n\n## 4\\. Suspension Components (springs, shock absorbers)\n- Coil spring winding machines: Produce coil springs to exact specifications\n- Leaf spring forming equipment: Shape and form leaf springs\n- Heat treatment furnaces: Strengthen springs and other components\n- Shot peening equipment: Increase fatigue strength of springs\n- CNC machining centers: Create precision parts for shock absorbers\n- Hydraulic cylinder assembly equipment: Assemble shock absorber components\n- Gas charging stations: Fill shock absorbers with pressurized gas\n- Spring testing machines: Verify spring rates and performance\n- Durability test rigs: Simulate real-world conditions to test longevity\n\n## 5\\. Brake System Parts (rotors, calipers, pads)\n- High-precision CNC lathes: Machine brake rotors to exact specifications\n- Grinding machines: Finish rotor surfaces for smoothness\n- Die casting machines: Produce caliper bodies\n- CNC machining centers: Mill and drill calipers for precise fit\n- Precision boring machines: Create accurate cylinder bores in calipers\n- Hydraulic press: Compress and form brake pad materials\n- Powder coating systems: Apply protective finishes to calipers\n- Assembly lines with robotic systems: Put together brake components\n- Brake dynamometers: Test brake system performance and durability\n\n\"\"\"\n\nbusiness_rules_over50 = \"\"\"\n- The engine components are critical and machinery should be kept online that corresponds to producing these components when capacity constraint is more or equal to 50%: engine components\n- Components for the following models should be prioritized when capacity constraint is more or equal to 50%: 1.Ford F-150\n\"\"\"\n\nbusiness_rules_25to50 = \"\"\"\n- The following components are critical and machinery should be kept online that corresponds to producing these components when capacity constraint is between 25-50%: engine components and transmission parts \n- Components for the following models should be prioritized when capacity constraint is between 25-50%: 1.Ford F-150 2.Ford Explorer\n\"\"\"\n\nbusiness_rules_0to25 = \"\"\"\n- The following components are critical and machinery should be kept online that corresponds to producing these components when capacity constraint is between 0-25%: engine components,transmission parts, Brake System Parts\n- Components for the following models should be prioritized when capacity constraint is between 0-25%: 1.Ford F-150 2.Ford Explorer 3.Ford Mustang 4.Ford Focus\n\"\"\"\n```", "```py\nuser.initiate_chat(teachable_agent, message=business_info, clear_history=True)\n```", "```py\nuser.initiate_chat(teachable_agent, message=business_rules_over50, clear_history=True)\n```", "```py\nuser.initiate_chat(teachable_agent, message=business_rules_25to50, clear_history=True)\n```", "```py\nuser.initiate_chat(teachable_agent, message=business_rules_0to25, clear_history=True)\n```", "```py\nSIMPLE QUESTION RESPONSE\n===========================\n>>>>>>>> USING AUTO REPLY...\nteachable_agent (to user):\nGiven the facility is experiencing a power shortage of 40%, this falls within the 25-50% capacity constraint range. According to your previously established priorities for such a scenario, the following models and components need to be prioritized:\n\n### Components to Prioritize\n- Engine components\n- Transmission parts\n- Brake System Parts\n\n### Models to Prioritize\n1\\. Ford F-150\n2\\. Ford Explorer\n\nYou should ensure that the machinery necessary to produce these critical components for the Ford F-150 and Ford Explorer is kept online.\n\nCOMPLEX MULTISTEP QUESTION RESPONSE\n====================================\n>>>>>>>> USING AUTO REPLY...\nteachable_agent (to user):\n\nIn response to the 40% power shortage, let's create a detailed plan to ensure the most critical machinery remains operational while deactivating less essential ones. \n\n### Critical Prioritization (0-50% capacity constraint):\n- **Critical Components**:\n  - Engine components (pistons, crankshafts, camshafts)\n  - Transmission parts\n  - Brake System Parts (rotors, calipers, pads)\n\n- **Prioritized Models**:\n  - Ford F-150\n  - Ford Explorer\n\n### Machines to Remain Active:\n1\\. **Engine Component Machines**:\n   - Engine Block Milling Machine\n   - Crankshaft Grinding Machine\n   - Camshaft Milling Machine\n\n2\\. **Transmission Part Machines**:\n   - Transmission Housing Caster\n   - Gear Cutting Machine\n   - Transmission Assembly Line\n\n3\\. **Brake System Part Machines**:\n   - Brake Rotor Casting Machine\n   - Brake Caliper Milling Machine\n   - Brake Pad Press\n\n### Machines to Deactivate:\n1\\. **Body Panel Machines**:\n   - Door Stamping Machine\n   - Hood Assembly Machine\n   - Fender Bending Machine\n\n2\\. **Suspension Component Machines**:\n   - Coil Spring Forming Machine\n   - Shock Absorber Assembly Line\n\n### Detailed Breakdown:\n\n#### Active Machines:\n- **Engine Block Milling Machine**:\n  - Produces critical engine blocks, essential for Ford F-150 and Ford Explorer.\n- **Crankshaft Grinding Machine**:\n  - Ensures high precision crankshafts; crucial for the performance of Ford F-150 and Ford Explorer.\n- **Camshaft Milling Machine**:\n  - Produces camshafts, necessary for Ford F-150 and Ford Explorer engines.\n\n- **Transmission Housing Caster**:\n  - Important for casting the housing of transmissions used in Ford F-150 and Ford Explorer.\n- **Gear Cutting Machine**:\n  - Precision gears production, vital for Ford F-150 and Ford Explorer transmissions.\n- **Transmission Assembly Line**:\n  - Assembly of complete transmission units for Ford F-150 and Ford Explorer.\n\n- **Brake Rotor Casting Machine**:\n  - Produces brake rotors, crucial for the safe braking systems in Ford F-150 and Ford Explorer.\n- **Brake Caliper Milling Machine**:\n  - Machining of brake calipers, essential for Ford F-150 and Ford Explorer.\n- **Brake Pad Press**:\n  - Manufacturing of brake pads, necessary for ensuring braking efficiency in Ford F-150 and Ford Explorer.\n\n#### Deactivated Machines:\n- **Door Stamping Machine**:\n  - While important, body panels like doors are less critical than engine and transmission components under current constraints.\n- **Hood Assembly Machine**:\n  - Deactivating hood assembly to free up power for critical components manufacturing.\n- **Fender Bending Machine**:\n  - Non-critical compared to engine and brake components during a significant power shortage.\n- **Coil Spring Forming Machine**:\n  - Suspension springs are lower priorities under current circumstances.\n- **Shock Absorber Assembly Line**:\n  - Suspension components aren’t critical enough to keep operational during this level of power shortage.\n\nThis plan ensures that production focuses on maintaining the critical components needed for primary models, the Ford F-150 and Ford Explorer, thereby maximizing the utility of the remaining power while managing production constraints effectively.\n```", "```py\n#simple question\nuser.initiate_chat(teachable_agent, message=\"The facility is experiencing a power shortage of 40%. What models need to be prioritized?\", clear_history=True)\n#multistep complex question\nuser.initiate_chat(teachable_agent, message=\"The facility is experiencing a power shortage of 30%. Provide me a detailed breakdown of what machines should be deactivated and which machines should remain active.\", clear_history=True)\n```"]