["```py\ndocuments = [\n    \"\"\"On October 2, 1872, Phileas Fogg, an English gentleman, left London for an extraordinary journey. \n    He had wagered that he could circumnavigate the globe in just eighty days. \n    Fogg was a man of strict habits and a very methodical life; everything was planned down to the smallest detail, and nothing was left to chance.\n    He departed London on a train to Dover, then crossed the Channel by ship. His journey took him through many countries, \n    including France, India, Japan, and America. At each stop, he encountered various people and faced countless adventures, but his determination never wavered.\"\"\",\n\n    \"\"\"However, time was his enemy, and any delay risked losing the bet. With the help of his faithful servant Passepartout, Fogg had to face \n    unexpected obstacles and dangerous situations.\"\"\",\n\n    \"\"\"Yet, each time, his cunning and indomitable spirit guided him to victory, while the world watched in disbelief.\"\"\",\n\n    \"\"\"With one final effort, Fogg and Passepartout reached London just in time to prove that they had completed their journey in less than eighty days. \n    This extraordinary adventurer not only won the bet but also discovered that the true treasure was the friendship and experiences he had accumulated along the way.\"\"\"\n]\n```", "```py\n0: On October 2, 1872, Phileas Fogg, an English gentleman, left London for an extraordinary journey. He had wagered that he could circumnavigate the globe in just eighty days. Fogg was a man of strict habits and a very methodical life; everything was planned down to the smallest detail, and nothing was left to chance.  \n1: He departed London on a train to Dover, then crossed the Channel by ship. His journey took him through many countries, including France, India, Japan, and America. At each stop, he encountered various people and faced countless adventures, but his determination never wavered.  \n2: However, time was his enemy, and any delay risked losing the bet. With the help of his faithful servant Passepartout, Fogg had to face unexpected obstacles and dangerous situations.  \n3: Yet, each time, his cunning and indomitable spirit guided him to victory, while the world watched in disbelief.  \n4: With one final effort, Fogg and Passepartout reached London just in time to prove that they had completed their journey in less than eighty days.  \n5: This extraordinary adventurer not only won the bet but also discovered that the true treasure was the friendship and experiences he had accumulated along the way.\n```", "```py\n0: On October 2, 1872, Phileas Fogg, an English gentleman, left London for an extraordinary journey. He had wagered that he could circumnavigate the globe in just eighty days. Fogg was a man of strict habits and a very methodical life; everything was planned down to the smallest detail, and nothing was left to chance.  \n1: He departed London on a train to Dover, then crossed the Channel by ship. His journey took him through many countries, including France, India, Japan, and America. At each stop, he encountered various people and faced countless adventures, but his determination never wavered.  \n2: However, time was his enemy, and any delay risked losing the bet. With the help of his faithful servant Passepartout, Fogg had to face unexpected obstacles and dangerous situations. Yet, each time, his cunning and indomitable spirit guided him to victory, while the world watched in disbelief.  \n3: With one final effort, Fogg and Passepartout reached London just in time to prove that they had completed their journey in less than eighty days. This extraordinary adventurer not only won the bet but also discovered that the true treasure was the friendship and experiences he had accumulated along the way.\n```"]