["```py\nFAST              : means that the system is targeted to deliver most\n                    responses to users within about five seconds, with the\n                    simplest analyses taking no more than one second and\n                    very few taking more than 20 seconds.\n\nANALYSIS          : means that the system can cope with any business logic \n                    and statistical analysis that is relevant for the\n                    application and the user, and keep it easy enough for\n                    the target user.\n\nSHARED            : means that the system implements all the security\n                    requirements for confidentiality (possibly down to cell\n                    level).\n\nMULTIDIMENSIONAL  : is our key requirement. If we had to pick a one-word\n                    definition of OLAP, this is it. The system must provide\n                    a multidimensional conceptual view of the data,\n                    including full support for hierarchies and multiple\n                    hierarchies, as this is certainly the most logical way\n                    to analyze businesses and organizations.\n\nINFORMATION       : is all of the data and derived information needed,\n                    wherever it is and however much is relevant for the\n                    application.\n```", "```py\nmeans that the system is targeted to deliver most responses to users\nwithin about five seconds, with the simplest analyses taking no more than\none second and very few taking more than 20 seconds.\n```", "```py\nmeans that the system can cope with any business logic and statistical\nanalysis that is relevant for the application and the user, and keep it\neasy enough for the target user.\n```", "```py\nmeans that the system implements all the security requirements for\nconfidentiality (possibly down to cell level).\n```", "```py\nis our key requirement. If we had to pick a one-word definition of OLAP,\nthis is it. The system must provide a multidimensional conceptual view of\nthe data, including full support for hierarchies and multiple\nhierarchies, as this is certainly the most logical way to analyze\nbusinesses and organizations.\n```", "```py\nis all of the data and derived information needed, wherever it is and\nhowever much is relevant for the application.\n```"]