["```py\nYou are a news recommendation system. Based on the user's reading history, \npredict how likely they are to read new articles. Score each article from 0 to 1000, \nwhere 1000 means highest likelihood to read.\n\nReading history (Previous articles read by the user):\n[List of previously read articles with titles and summaries]\n\nPlease rate the following articles (provide a score 0-1000 for each):\n[List of candidate articles to rate]\n\nYou must respond with a JSON object in this format:\n{\n    \"recommendations\": [\n        {\n            \"article_id\": \"article-id-here\",\n            \"score\": score\n        }\n    ]\n}\n```", "```py\nUser has 221 articles in reading history\n\nTop 5 Comparison:\n--------------------------------------------------------------------------------\n\nTop 5 Predicted by Claude:\n1\\. Wie ich mit 38 Jahren zum ersten Mal lernte, strukturiert zu arbeiten (Score: 850, Actual Value: 253.0)\n2\\. Warum wir den Umgang mit der Sonne neu lernen müssen (Score: 800, Actual Value: 757.0)\n3\\. Lohnt sich ein Speicher für Solarstrom vom Balkon? (Score: 780, Actual Value: 586.0)\n4\\. »Man muss sich fragen, ob dieser spezielle deutsche Weg wirklich intelligent ist« (Score: 750, Actual Value: 797.0)\n5\\. Wie Bayern versucht, sein Drogenproblem unsichtbar zu machen (Score: 720, Actual Value: 766.0)\n\nActual Top 5 from Survey:\n4\\. »Man muss sich fragen, ob dieser spezielle deutsche Weg wirklich intelligent ist« (Value: 797.0, Predicted Score: 750)\n5\\. Wie Bayern versucht, sein Drogenproblem unsichtbar zu machen (Value: 766.0, Predicted Score: 720)\n2\\. Warum wir den Umgang mit der Sonne neu lernen müssen (Value: 757.0, Predicted Score: 800)\n6\\. Abitur als Lotterie? (Value: 601.0, Predicted Score: 650)\n3\\. Lohnt sich ein Speicher für Solarstrom vom Balkon? (Value: 586.0, Predicted Score: 780)\n\nPerformance Metrics:\n--------------------------------------------------------------------------------\nSpearman Correlation: 0.673\nPrecision@5: 0.800\n\nClaude's Analysis:\n--------------------------------------------------------------------------------\n1\\. Key patterns in user's reading history:\n- Strong interest in social and political issues\n- Regular engagement with lifestyle and personal development content\n- Interest in health and wellness topics\n- Frequent reading of articles about economic and financial matters\n- Attraction to critical analysis and commentary pieces\n- Interest in food and cooking content\n\n2\\. Scoring explanation:\n\nHighest scored articles:\n- \"Wie ich mit 38 Jahren zum ersten Mal lernte, strukturiert zu arbeiten\" (850) - Aligns with the user's interest in personal development and lifestyle content\n- \"Warum wir den Umgang mit der Sonne neu lernen müssen\" (800) - Matches interest in health and wellness topics\n- \"Lohnt sich ein Speicher für Solarstrom vom Balkon?\" (780) - Corresponds to interest in practical advice and economic considerations\n\nMedium scored articles:\n- \"Man muss sich fragen, ob dieser spezielle deutsche Weg wirklich intelligent ist\" (750) - Fits pattern of interest in political commentary\n- \"Wie Bayern versucht, sein Drogenproblem unsichtbar zu machen\" (720) - Matches interest in social issues and critical reporting\n- \"Abitur als Lotterie?\" (650) - Aligns with interest in educational and social topics\n\nLower scored articles:\n- \"Eine Brise Formel 1\" (550) - Limited sports content in reading history\n- \"Reizender Absatz\" (450) - Less alignment with demonstrated interests\n- \"Hier wird jetzt auf ganz, ganz hohem Niveau gemeckert\" (400) - Style and topic less aligned with user preferences\n\nThe scoring prioritizes articles that match the user's demonstrated interests in social issues, practical advice, and critical analysis while giving lower scores to sports and lighter content that appears less frequently in their reading history.\n```"]